# UIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GridNode..::..UIndex Property
GridNode Structure See Also
---
The node's index along the U axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int UIndex { get; set; }
```

Visual Basic
---
```text
Public Property UIndex As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int UIndex {
	int get ();
	void set (int value);
}
```

# See Also
GridNode Structure
Autodesk.Revit.DB Namespace